//Выведите на экран фразу:
//What Is Dead May Never Die!
//Попробуйте внести в код какую-нибудь синтаксическую ошибку. Например,
// "забудьте" закрыть скобку или поставить точку с запятой в конце. Запустите
// проверку и посмотрите, как отреагирует компилятор. Обратите внимание, что помимо
// самой ошибки, компилятор указывает файл и номер строки, где по его мнению допущена ошибка.
//Перед завершением упражнения не забудьте исправить все допущенные ошибки
package Hexlet.Module1.OsnovyJava.Kurs;

class App10 {
    public static void main(String[] args) {
        // BEGIN (write your solution here)
        System.out.println("What Is Dead May Never Die!");
        // END
    }
}


public class _11WhatIsDeadMayNeverDie {
}
