//Выведите на экран друг за другом три имени: Robert, Stannis, Renly. В результате
// на экране должно отобразиться:
//Robert
//Stannis
//Renly
//Для каждого имени используйте свой собственный вызов System.out.println().
package Hexlet.Module1.OsnovyJava.Kurs;

class App2 {
    public static void printNames(String[] args) {
        // BEGIN (write your solution here)
        System.out.println("Robert");
        System.out.println("Stannis");
        System.out.println("Renly");
        // END
    }
}

public class _3RobertStannisRenly {
}
