//Выведите на экран строку 2 times, полученную из числа 2.9 и строки times,
// используя преобразования типов и конкатенацию:
//2 times
package Hexlet.Module1.OsnovyJava.Kurs;

class App7 {
    public static void main(String[] args) {
        // BEGIN (write your solution here)
        System.out.println((int)2.9 + " times");
        // END
    }
}
public class _8TwoTimes {
}
